W8D1/art-share-api-part-2/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1 WHERE "artworks"."id" = $2  [["image_url", "buddyup.xyz"], ["id", 2]]
---
    def update
        artwork = Artwork.find(params[:id])
        if artwork.update!(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 8]]
SELECT "artworks".* FROM "artworks"
---
    def destroy
        artwork = Artwork.find(params[:id])
        artwork.destroy
        render json: Artwork.all