W8D1/art-share-api-part-2/app/controllers/users_controller.rb

    def index
        if !params[:query].nil?
            query = "%" + params[:query] + "%"
            user = User.where("username LIKE ?", query)
            render json: user
        else
            render json: User.all
---
SELECT "users".* FROM "users" WHERE (username LIKE '%'aru'')
SELECT "users".* FROM "users"

    def update
        user = User.find(params[:id])
        if user.update!(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1 WHERE "users"."id" = $2  [["name", "hahahahawhaoda"], ["id", 3]]

    def destroy
        user = User.find(params[:id])
        user.destroy
        render json: User.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
SELECT "users".* FROM "users"