W7D3/route-project/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1 WHERE "users"."id" = $2  [["name", "hahahahawhaoda"], ["id", 3]]
---
    def update
        user = User.find(params[:id])
        user.update!(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
SELECT "users".* FROM "users"
---
    def destroy
        user = User.find(params[:id])
        user.destroy
        render json: User.all