W9D1/nine-nine-cats/app/views/cat_rental_requests/new.html.erb

SELECT "cats".* FROM "cats"
---
    <option value="" selected disabled hidden>-- select a cat --</option>
    <% Cat.all.each do |cat| %>