W9D1/nine-nine-cats/app/models/cat_rental_request.rb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE (('2020-10-01' <= end_date) AND ('2020-10-10' >= start_date) AND cat_id = 3 AND NOT (6 = id)) AND (status = 'PENDING')
SELECT  1 AS one FROM "cat_rental_requests" WHERE (('2020-10-01' <= end_date) AND ('2020-10-10' >= start_date) AND cat_id = 3) AND (status = 'APPROVED') LIMIT $1  [["LIMIT", 1]]
---
  def does_not_overlap_approved_request
    if overlapping_approved_requests.exists?