W9D1/nine-nine-cats/app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 3], ["start_date", "2020-10-01"], ["end_date", "2020-10-10"], ["created_at", "2020-10-20 09:48:50.185008"], ["updated_at", "2020-10-20 09:48:50.185008"]]
---
  def create

    cat_rental_request = CatRentalRequest.new(cat_rental_request_params)
    if cat_rental_request.save

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def approve
    @current_request = CatRentalRequest.find_by(id: params[:id])

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def deny
    @current_request = CatRentalRequest.find_by(id: params[:id])