W9D1/nine-nine-cats/app/controllers/cats_controller.rb

    def update
        @cat = Cat.find_by(id: params[:id])
        if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "Funny lil guy. Love him"], ["updated_at", "2020-10-18 09:20:49.091224"], ["id", 4]]